# US births between 1994 and 2014

Author: Ye Joo Park ([ypark32@illinois.edu](mailto:ypark32@illinois.edu))

- Data Source: [FiveThirtyEight - GitHub Repository](https://github.com/fivethirtyeight/data/tree/master/births)
- Relevant Article: [Some People Are Too Superstitious To Have A Baby On Friday The 13th](http://fivethirtyeight.com/features/some-people-are-too-superstitious-to-have-a-baby-on-friday-the-13th/)
- Data License: [CC-BY 4.0](https://creativecommons.org/licenses/by/4.0/)

In [1]:
import pandas as pd
import numpy as np

### About the dataset

`US_births_1994-2003.csv` contains U.S. births data for the years 1994 to 2014, as provided by the Centers for Disease Control and Prevention's National Center for Health Statistics and the Social Security Administration.

The dataset is based on two CSV files provided by FiveThirtyEight. You can view the original CSV files at [FiveThirtyEight GitHub Repository](https://github.com/fivethirtyeight/data/tree/master/births).

In [2]:
df = pd.read_csv('US_births_1994-2014.csv')

Run the code below to print out the first 5 rows.

In [3]:
df.head()

         date  births
0  1994-01-01    8096
1  1994-01-02    7772
2  1994-01-03   10142
3  1994-01-04   11248
4  1994-01-05   11053

The dataset only contains two columns:

1. `date`: All dates between 1994 and 2014
2. `births`: Number of births for a specific date

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7670 entries, 0 to 7669
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    7670 non-null   object
 1   births  7670 non-null   int64
dtypes: int64(1), object(1)
memory usage: 120.0+ KB

### Part 1: Handle datetime

The first step of our analysis is to

In [5]:
df['date'] = pd.to_datetime(df['date'])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7670 entries, 0 to 7669
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    7670 non-null   datetime64[ns]
 1   births  7670 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 120.0 KB

In [7]:
str(df['date'].dtype)

'datetime64[ns]'

In [8]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month
df['day'] = df['date'].dt.day
df['weekday'] = df['date'].dt.weekday
df['day_name'] = df['date'].dt.day_name()

df.head(3)

        date  births  year  month  day  weekday  day_name
0 1994-01-01    8096  1994      1    1        5  Saturday
1 1994-01-02    7772  1994      1    2        6    Sunday
2 1994-01-03   10142  1994      1    3        0    Monday

### Part 2: Summary by multiple measures

The first step of our analysis is to

In [9]:
df['births'].mean()

11132.49374185137

In [10]:
df['births'].min()

5728

In [11]:
df['births'].max()

16081

In [12]:
df.groupby('year', as_index=False).agg({
      'births': np.mean
})

    year        births
0   1994  10829.498630
1   1995  10683.805479
2   1996  10632.497268
3   1997  10632.586301
4   1998  10798.775342
5   1999  10847.717808
6   2000  11089.655738
7   2001  11029.953425
8   2002  11018.427397
9   2003  11205.342466
10  2004  11439.516393
11  2005  11539.564384
12  2006  11877.134247
13  2007  12002.147945
14  2008  11777.969945
15  2009  11482.167123
16  2010  11112.260274
17  2011  10977.830137
18  2012  10931.333333
19  2013  10885.854795
20  2014  10987.758904

In [18]:
feb_29th_mask = (df['month'] == 2) & (df['day'] == 29)

df_feb_29th = df[feb_29th_mask]
df_feb_29th

           date  births  year  month  day  weekday   day_name
789  1996-02-29   10692  1996      2   29        3   Thursday
2250 2000-02-29   11645  2000      2   29        1    Tuesday
3711 2004-02-29    7301  2004      2   29        6     Sunday
5172 2008-02-29   11631  2008      2   29        4     Friday
6633 2012-02-29   11042  2012      2   29        2  Wednesday

In [25]:
df_not_feb_29th[~df_not_feb_29th['year'] \
    .isin(df_feb_29th['year'])]

789     1996
2250    2000
3711    2004
5172    2008
6633    2012
Name: year, dtype: int64

In [24]:
df_not_feb_29th = df[~feb_29th_mask]
df_not_feb_29th[~df_not_feb_29th['year'] \
    .isin(df_feb_29th['year'])] \
    .groupby('year', as_index=False) \
    .agg({
        'births': np.mean
    })

    year        births
0   1994  10829.498630
1   1995  10683.805479
2   1997  10632.586301
3   1998  10798.775342
4   1999  10847.717808
5   2001  11029.953425
6   2002  11018.427397
7   2003  11205.342466
8   2005  11539.564384
9   2006  11877.134247
10  2007  12002.147945
11  2009  11482.167123
12  2010  11112.260274
13  2011  10977.830137
14  2013  10885.854795
15  2014  10987.758904

In [14]:
friday_13th = (df['day_name'] == 'Friday') & (df['day'] == 13)

df[friday_13th]

           date  births  year  month  day  weekday day_name
132  1994-05-13   11085  1994      5   13        4   Friday
377  1995-01-13   11071  1995      1   13        4   Friday
650  1995-10-13   11078  1995     10   13        4   Friday
986  1996-09-13   12019  1996      9   13        4   Friday
1077 1996-12-13   10623  1996     12   13        4   Friday
1259 1997-06-13   11214  1997      6   13        4   Friday
1504 1998-02-13   11203  1998      2   13        4   Friday
1532 1998-03-13   11120  1998      3   13        4   Friday
1777 1998-11-13   10968  1998     11   13        4   Friday
2050 1999-08-13   11924  1999      8   13        4   Friday
2477 2000-10-13   11468  2000     10   13        4   Friday
2659 2001-04-13   10741  2001      4   13        4   Friday
2750 2001-07-13   11978  2001      7   13        4   Friday
3177 2002-09-13   12786  2002      9   13        4   Friday
3268 2002-12-13   11378  2002     12   13        4   Friday
3450 2003-06-13   11821  2003      6   13        4   Friday
3695 2004-02-13   11749  2004      2   13        4   Friday
3877 2004-08-13   12275  2004      8   13        4   Friday
4150 2005-05-13   11803  2005      5   13        4   Friday
4395 2006-01-13   11994  2006      1   13        4   Friday
4668 2006-10-13   12628  2006     10   13        4   Friday
4850 2007-04-13   12168  2007      4   13        4   Friday
4941 2007-07-13   13228  2007      7   13        4   Friday
5277 2008-06-13   12394  2008      6   13        4   Friday
5522 2009-02-13   11832  2009      2   13        4   Friday
5550 2009-03-13   12087  2009      3   13        4   Friday
5795 2009-11-13   11739  2009     11   13        4   Friday
6068 2010-08-13   12092  2010      8   13        4   Friday
6341 2011-05-13   11125  2011      5   13        4   Friday
6586 2012-01-13   11380  2012      1   13        4   Friday
6677 2012-04-13   10910  2012      4   13        4   Friday
6768 2012-07-13   12109  2012      7   13        4   Friday
7195 2013-09-13   12669  2013      9   13        4   Friday
7286 2013-12-13   11484  2013     12   13        4   Friday
7468 2014-06-13   11651  2014      6   13        4   Friday